import requests
from requests import get
import random
from random import randint




print(" ▄████▄  ▓█████  ██▓    ▓█████   ██████ ▄▄▄█████▓ ██▀███   ██▓ ▄▄▄      ▓█████▄  ▄▄▄          ▄█████▓ ▒█████   ▒█████   ██▓ ")
print("▒██▀ ▀█  ▓█   ▀ ▓██▒    ▓█   ▀ ▒██    ▒ ▓  ██▒ ▓▒▓██ ▒ ██▒▓██▒▒████▄    ▒██▀ ██▌▒████▄       ▓  ██▒ ▓▒▒██▒  ██▒▒██▒  ██▒▓██▒")
print("▒▓█    ▄ ▒███   ▒██░    ▒███   ░ ▓██▄   ▒ ▓██░ ▒░▓██ ░▄█ ▒▒██▒▒██  ▀█▄  ░██   █▌▒██  ▀█▄     ▒ ▓██░ ▒░▒██░  ██▒▒██░  ██▒▒██░")
print("▒▓▓▄ ▄██▒▒▓█  ▄ ▒██░    ▒▓█  ▄   ▒   ██▒░ ▓██▓ ░ ▒██▀▀█▄  ░██░░██▄▄▄▄██ ░▓█▄   ▌░██▄▄▄▄██    ░ ▓██▓ ░ ▒██   ██░▒██   ██░▒██░")
print(" ▒ ▓███▀ ░░▒████▒░██████▒░▒████▒▒██████▒▒  ▒██▒ ░ ░██▓ ▒██▒░██░ ▓█   ▓██▒░▒████▓  ▓█   ▓██▒     ▒██▒ ░ ░ ████▓▒░░ ████▓▒░░██████▒")
print("░ ░▒ ▒  ░░░ ▒░ ░░ ▒░▓  ░░░ ▒░ ░▒ ▒▓▒ ▒ ░  ▒ ░░   ░ ▒▓ ░▒▓░░▓   ▒▒   ▓▒█░ ▒▒▓  ▒  ▒▒   ▓▒█░     ▒ ░░   ░ ▒░▒░▒░ ░ ▒░▒░▒░ ░ ▒░▓  ░")
print("  ░  ▒    ░ ░  ░░ ░ ▒  ░ ░ ░  ░░ ░▒  ░ ░    ░      ░▒ ░ ▒░ ▒ ░  ▒   ▒▒ ░ ░ ▒  ▒   ▒   ▒▒ ░       ░      ░ ▒ ▒░   ░ ▒ ▒░ ░ ░ ▒  ░")
print("░           ░     ░ ░      ░   ░  ░  ░    ░        ░░   ░  ▒ ░  ░   ▒    ░ ░  ░   ░   ▒        ░      ░ ░ ░ ▒  ░ ░ ░ ▒    ░ ░   ")
print("░ ░         ░  ░    ░  ░   ░  ░      ░              ░      ░        ░  ░   ░          ░  ░                ░ ░      ░ ░      ░  ░      by @celestriada")
print("Выберите запрос:")
print(f"1. Слежка.   2. Поиск информации.    3. Свага метр     4. DOS Атака")
a = input()
if a == "1":
    print("Выберите человека за которым будем следить.")
    find = input()
    print('Поиск', find)
    print('Найден пользователь', find) 
    print('Вы хотите следить за ним?  y/n',)
    y = input()
    if y == 'y':
        print('Для слежки нужен API, а у вас его нету из пользователя', find)
    if y == 'n':
        print('Отмена')
if a == '2':
    poisk = input('Напишите текст который ищете: ')
    response = requests.get('https://yandex.ru/search/?lr=10670', poisk)
    print(response, 'запрос был отправлен')
if a =='3':
    print('Cвага метр')
    input('Напишите вашу шмотку или шузы: ')
    procent = random.randint(1, 100)
    print(procent)
    if procent is not None and procent < 10: 
        print('Свага не найдена')
    if procent is not None and procent > 11:
        print('Свага имеется')
if a == '4':
    print('Файл сделан отдельно (dos_attack.py)')

else:
    print('Нету такого числа')